const MENU_TEXT = {
    MAIN: `&emsp;&emsp;Добро пожаловать в текстовую ролевую игру по вселенной <i><u>Naruto - Raise of a Ninja</u></i>! Здесь Вы можете с головой окунуться во времена зарождения Скрытых Деревень; в ту эпоху, когда Хаширама и Мадара, временно прервавшие свою вражду, объединились с целью основать первую деревню шиноби - <i>Конохагакуре но Сато</i>. 
            <br>&emsp;&emsp;Эпоха первых Каге и борьбы за власть между кланами: создай своего шиноби, самурая или агента Даймё и окажи своё глобальное влияние на сюжет, ведь в нашем проекте каждый игрок обладает полной свободой действий!`,
    RULES: `<u>I. ОСНОВНЫЕ ПРАВИЛА</u>
            <br>• В пределах группы запрещена несогласованная реклама, порнография, шок-контент и офф-топ.
            <br>• В пределах чата запрещены конфликты на почве религии, расы, политики и иных чувствительных тем.

            <br><br><u>II. ИГРОВЫЕ ПРАВИЛА</u>
            <br>• Рейтинг ролевой: NC-21 - в постах допустимы мат, сцены эротического характера и насильственных действий с подробным описанием.
            <br>• Необходимый возраст для регистрации в проекте: 18 лет. Подавая анкету Вы автоматически подтверждаете Вашу ознакомленность со всеми правилами проекта и факт достижения Вами совершеннолетия в рамках законодательства РФ.
            <br>• Количество допустимых персонажей на одном аккаунте ВК: 2
            <br>• Мультиаккаунт разрешен при условии, что при регистрации Вы оповестите администрацию о том, что это Ваш аккаунт. В противном случае все персонажи на любых аккаунтах кроме основного будут безвозвратно удалены, а всё их снаряжение и иные ценные предметы - утеряны и/или доступны к нахождению другими игроками.
            <br>• Запрещена регистрация нескольких персонажей в один клан или организацию одним человеком.
            <br>• Запрещена нечестная игра с целью извлечения выгоды одним персонажем в ущерб другому (между персонажами одного человека).
            <br>• Оформление игровых постов в строго литературном стиле. Каждый пост должен содержать не менее 50-ти слов.
            <br>• В небоевых постах можно взаимодействовать с дружественными и нейтральными NPC .
            <br>• Запрещено отыгрывать любые действия чужих персонажей.
            <br>• При игре с тремя или более игроками одновременно необходимо придерживаться очередности. Лимит времени на написание поста: 24 часа. В случае просрочки другие игроки имеют право пропустить Ваш ход без обсуждения этого вопроса с Вами. Аналогино с боевыми постами, но там лимит расширен до 36-ти часов.
            <br>• За каждого персонажа нужно отписывать игровые посты не реже чем раз в 14 дней.

            <br><br><u>III. БОЕВЫЕ ПРАВИЛА</u>
            <br>• Запрещено любое использование NPC в бою.
            <br>• Вы можете использовать только то снаряжение и способности, которые прописаны в актуальной анкете Вашего персонажа и согласованы с анкетологом проекта.
            <br>• В бою, как и в обычной игре, должна соблюдаться очередность написания постов. Лимит времени на пост: 36 часов. В противном случае действия прописанные Вашим соперником - проходят не встречая сопротивления. Если же противник еще ничего не успел написать - очередь переходит к нему.
            <br>• Очередь определяется договоренностью между игроками или жребием.
            <br>• Судьей в бою может быть не только администратор, но и любой другой игрок. Единственное условие: согласие с выбранным судьей от каждого участника боя. При этом соглашаясь с выбором судьи Вы автоматически соглашаетесь с каждым его вердиктом, поэтому подходите к выбору с умом.
            <br>• Наличие судьи необязательно, если игроки могут лично согласовать друг с другом последствия их действий.
            <br>• Судья выносит вердикт в конце каждого игрового круга (по посту от каждого участника боя).
            <br>• Вердикт судьи может быть оспорен игроком, но только в том случае, если он повлек за собой: смерть / серьезные увечья / потерю ценных артефактов.
            `,
    ROLES: `Ниже представлен список существующих в ролевой канонических персонажей.`,
    LORE: `&emsp;&emsp;Конец войны ознаменовал начало новой эры мира. Ключевым событием стало проявление дружбы со стороны Хаширамы Сенджу, который протянул руку помощи Учиха Мадаре, тем самым превратив их детскую мечту в реальность. Став союзниками, кланы Учиха и Сенджу заключили договор с Хи но Куни, что дало согласие на создание Какурезато в её границах, которая впоследствии была названа Конохагакуре. Другие кланы, стремящиеся разделить этот новый мир, также начали оседать в Конохе. Основание Деревни Скрытого Листа положило конец эпохе воюющих государств.<br>
            &emsp;&emsp;Пример того, как непримиримые враги, такие как Сенджу и Учиха, смогли достичь мира, вдохновил другие кланы из соседних стран на создание собственных альянсов, что привело к образованию новых скрытых деревень: Сунагакуре, Киригакуре, Кумогакуре и Ивагакуре, где были избраны свои Каге. Эти деревни впоследствии стали известны как Шиноби Годайкоку (忍び五大国, "Пять великих стран шиноби"). Политическая ситуация претерпела резкие изменения: несмотря на все еще значительное влияние дайме, их позиции постепенно ослабевали, и главными действующими лицами становились шиноби, которые еще вчера были врагами.<br> 
            &emsp;&emsp;Однако исчезли ли старые конфликты? Были ли зарыты топоры войны? Все это побудило Первого Хокаге Хашираму отправить послание всем Каге с просьбой собраться на первое в истории собрание, запланированное в стране Железа.`,
    ARTICLES: `Здесь пока пусто.`,
    SIGNUP: `
    ПРАВИЛА РЕГИСТРАЦИИ.
    <br>• При регистрации Вам необходимо выбрать характеристики, набор техник, навыков и снаряжение персонажа. Учтите, что эти параметры почти никак нельзя будет изменить в дальнейшем, за исключением особых случаев (прим. таймскип в сюжете ролевой). 
    Подходите к созданию персонажа с умом. Наш анкетолог с радостью ответит на Ваши вопросы, возникающие в процессе создания билда.
    <br>• После одобрения анкеты у Вас будет еще 7 дней на то, чтобы внести корректировки в боевой билд. 
    <br>• Изменить внешность/имя/биографию/характер и прочие данные персонажа после одобрения анкеты нельзя. Анкеты сохраняются администраторами в момент принятия и любое последующее их редактирование наказуемо. Наказание выбирается единым решением администрации.
    <br>• Ограничение на снаряжение не распространяется на артефакты добытые в бою или приобретенные сюжетно.
    <br>• Имя персонажа должно быть японским и существующим в реальной жизни. Фамилия может быть выдумана, но должна быть подобной японским фамилиям и не содержать в себе каламбуров. 

    <br><br>ШАБЛОН АНКЕТЫ.<br>
    1. Имя, клан, прозвище:
    <br>2. Возраст:
    <br>3. Внешность и физические характеристики:
    <br>4. Характер:
    <br>5. Цели и мотивация:
    <br>6. Биография:
    <br>7. Важные связи:<br>

    <br>БОЕВАЯ АНКЕТА (нужно отправить в сообщения группы).

    <br>8. Подробное описание снаряжения (включая уникальные предметы):
    <br>9. Прототип для параметров (если используется датабук/ориентир):
    <br>10. Освоенные стихии.
    <br>11. Кеккей Генкай и другие особенности (при наличии):
    <br>12. Навыки (боевые и небоевые):
    <br>13. Список техник:
    
    <br><br>Для регистрации нужно добавить фотографию своего персонажа в <a href="https://vk.com/roan_role?from=groups&z=album-179774276_309639086"><u>фотоальбом</u></a> "Регистрация" в нашей группе ВКонтакте.<br> Там же можно найти представленную анкету и пример ее заполнения.
    <br><u>БОЕВОЙ БИЛД ОТПРАВЛЯЕТСЯ ОТДЕЛЬНО В СООБЩЕНИЯ ГРУППЫ!</u>
    
    `

}

const ROLE_DESCRIPTIONS = {
    HASHIRAMA: `Статус: Свободен<br><br>Хаширама Сенджу (яп. 千手柱間) сильнейший шиноби из клана Сенджу. 
                Наряду с Учиха Мадарой является одним из основателей Деревени Скрытого Листа.`,
    MADARA: `Статус: Занят<br><br>Мадара Учиха (яп. うちはマダラ) легендарный лидер клана Учиха. 
            Он основал Деревню Скрытого Листа вместе со своим другом и соперником, Хаширамой Сенджу, с намерением положить начало мирной эпохе.`,
    MUU: `Статус: Занят<br><br>Муу (яп. 無), также известный как «Нечеловек» (яп. 無人, Муджин) 
        являлся одним из двух главных кандидатов на место Первого Цучикаге, но проиграл конкуренцию Джишин Акимичи.`,
    TOBIRAMA: `Статус: Свободен<br><br>Тобирама Сенджу (яп. 千手扉間) член знаменитого клана Сенджу, который вместе со своим старшим братом и кланом Учиха основал первую деревню шиноби — Деревню Скрытого Листа.`,
    GENGETSU: `Статус: Свободен<br><br>Генгецу Хозуки (яп. 鬼灯幻月) — наряду с Канной Юки был претендентом на пост Первого Мизукаге. Глава клана Хозуки.`
}

export default {
    MENU_TEXT,
    ROLE_DESCRIPTIONS
}